// forEach - перебор элементов массива. 1 параметр item (эл массива), 2 пар (индексы массива) 3 пар (arr - сам массив)

// const arr = [1, 2, 3, 4, 5];

// arr.forEach((item, index, arr) => {
//   console.log(item, index, arr);
// });

/////////////////////////////////////////////

// map - перебор эл массива и возврат нового массива на основе текущего

// const arr = [1, 2, 3, 4, 5];

// const arrMap = arr.map((item, index, arr) => {
//   return 1; // он вернёт новый массив такой же длинной как старый
// });
// console.log(arrMap);

//////////////////////////////////////////////

// reduce - перебор элементов массива и возврат новой структуры данных

// const arr = [1, 2, 3, 4, 5];

// const something = arr.reduce((acc, item, index, _arr) => {
//   acc[item] = index
//   return acc
// }, {})
// console.log(something);

////////////////////////////////////////////////////

// find - позволяет найти элемент по условию и возвращает его

// const arr = [1, 2, 3, 4, 5];
// const elem = arr.find((item, index, _arr) => {
//   return item === 4;
// });
// console.log(elem);

///////////////////////////////////////////////////

// findIndex тоже самое что и find, но возыращает индекс элемента, которое выполняет условия.

//////////////////////////////////////////////////

// filter -  Отфилтровывает старый массив по условию и возвращает новый массив.

// const arr = [1, 2, 3, 4, 5];

// const filterArr = arr.filter((item, index, _arr) => {
//   return item > 3
// });
// console.log(filterArr);

////////////////////////////////////////////////

// push - вставляет элемент в конец массива

// const arr = [1, 2, 3, 4, 5];
// arr.push(10, 12, 13,14) // возвращает новую длинну массива
// console.log(arr); // важно! исходный массив меняется.

///////////////////////////////////////////////////

// unshift - вставляет элемент в начало массива.

// const arr = [1, 2, 3, 4, 5];
// arr.unshift(10, 12, 13, 14); // возвращает новую длинну массива
// console.log(arr); // важно! исходный массив меняется.

/////////////////////////////////////////////////

// pop - удаляет последний элемент массива и возвращает его и изменяет массив исходный

// const arr = [1, 2, 3, 4, 5];
// const lastEl = arr.pop()
// console.log(arr);
// console.log(lastEl);

/////////////////////////////////////////////

// shift - удаляет первый элемент массива и возвращает его и изменяет массив исходный

// const arr = [1, 2, 3, 4, 5];
// const qwe = arr.shift()
// console.log(arr);
// console.log(qwe);

////////////////////////////////////////////

// concat - создаёт новый массив с переданными значениями в конце (он не изменяет исходный массив)

// const arr = [1, 2, 3, 4, 5];
// const arr2 = [6, 7, 8, 9, 10]
// const newArr = arr.concat(arr2)
// console.log(newArr);
// console.log(arr);

///////////////////////////////////////////

// join - позволяет соеденить массив в строку

// const str = 'qweqweqweqwe'
// const qwe = str.split('').join('-')
// console.log(qwe);
// console.log(str);

///////////////////////////////////////////

// sort - позволяет отсортировать массив (изменяет исходный масив)

// const arr = [1, 23, 2, 10, 4, 5];
// const qwe = arr.sort() // изначально сравнивает строки

// const qwe = arr.sort((a, b) => {
// if (a > b) return 1
// if (a === b) return 0;
// if (a < b) return -1;

// return a - b
//   return b - a
// });

// console.log(qwe);

/////////////////////////////////////////////

// isArray - проверяет на массив

// const arr = [1, 23, 2, 10, 4, 5];

// const w = Array.isArray(arr)
// console.log(w);

/////////////////////////////////////////////

// splise - позволяет удалять и вставлять элементы. Но делает это откуда угодно. массив мутирует

// const arr = [1, 23, 2, 10, 4, 5];

// const qwe = arr.splice(index, deleteCount, ...)

// const qwe = arr.splice(0, 1)

// const qwe = arr.splice(0, 1, 12)
// console.log(qwe);
// console.log(arr);

//////////////////////////////////////////////

// slice = позводяет вернуть новый подмассив из переданного

// const arr = [1, 23, 2, 10, 4, 5];
// const qwe = arr.slice(1, -1)
// console.log(qwe);
// console.log(arr);

////////////////////////////////////////////

//indexOf - возвращает индекс числа массива

// const arr = [1, 23, 2, 10, 4, 5];

// const qwe = arr.indexOf(23) // если числа нет, то вернёт -1. 2 праметр указывает с какого числа начинаем искать
// console.log(qwe);

/////////////////////////////////////////

//lastIndexOf - возвращает индекс числа массива но поиск с права налево

/////////////////////////////////////////

// includes - возвращает true либо false при выполнении

// const arr = [1, 23, 2, 10, 4, 5];
// const chek = arr.includes(1)
// console.log(chek);

////////////////////////////////////////

// reverse - переворачивает массив 

// const arr = [1, 23, 2, 10, 4, 5];

// const qwe = arr.reverse()
// console.log(qwe);
// console.log(arr);
